# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
a1 = pd.Series([4,8,15,16,23,42])

In [3]:
a1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [4]:
type(a1)

pandas.core.series.Series

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [5]:
a2 = pd.Series([[1,2,3,4,5,6,7,8,9,10]])

In [6]:
a2

0    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
dtype: object

In [7]:
type(a2)

pandas.core.series.Series

# Q3. Create a Pandas DataFrame that contains the following data

In [8]:
l1 = [['Alice',25,'Female'],
     ['Bob',30,'Male'],
     ['Claire',27,'Female']]

In [9]:
pd.DataFrame(l1, columns =['Name','Age','Gender'] )

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [10]:
'''
DataFrame is a method of library which can convert data the into tabular form and which is a list.

It is different from pandas.series because of series shows only a particular column but DataFrame shows the whole data in a tabular form.

'''

'\nDataFrame is a method of library which can convert data the into tabular form and which is a list.\n\nIt is different from pandas.series because of series shows only a particular column but DataFrame shows the whole data in a tabular form.\n\n'

In [11]:
l2 = [['Shiv',22,'Cricketer'],
     ['Salman khan',45,'Bakwass actor'],
     ['Tiger sheroff',33,'Choti bachi ho kya']]

In [12]:
q1 = pd.DataFrame(l2, index = None, columns = ['Name','age','profession'] )

In [13]:
q1

            Name  age          profession
0           Shiv   22           Cricketer
1    Salman khan   45       Bakwass actor
2  Tiger sheroff   33  Choti bachi ho kya

In [14]:
q1['Name']

0             Shiv
1      Salman khan
2    Tiger sheroff
Name: Name, dtype: object

In [15]:
q1[['age','profession']]

   age          profession
0   22           Cricketer
1   45       Bakwass actor
2   33  Choti bachi ho kya

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Canyou give an example of when you might use one of these functions?

In [16]:
'''
The commmon functions are :
1) head()
2) tail()
3) dropna()
4) shape()
5) sort_values()

'''

'\nThe commmon functions are :\n1) head()\n2) tail()\n3) dropna()\n4) shape()\n5) sort_values()\n\n'

In [17]:
w1 = pd.read_csv('Customer-Table.csv')

In [18]:
w1

,customer_id,name,address,city,state,zipcode,country
0,1980,Leocadia Andersen,7015 Fairground Street,Dearborn,MI,48124,US
1,2463,Chad Lucero,142 Wakehurst Drive,Santa Clara,CA,95050,US
2,1978,Stone Randall,898 Peninsula Circle,Oakland Gardens,NY,11364,US
3,9383,Emelia Braun,101 Military Street,Blacksburg,VA,24060,US
4,8940,Ridley Velez,280 Pennington Drive,Clemmens,NC,27012,US
5,8940,Ridley Velez,280 Pennington Drive,Clemmens,NC,27012,US
6,2512,Devadas Sloan,8906 East John Street,Carol Stream,IL,60188,US
7,1928,Jamaal Proctor,374 New Lane,Westerville,OH,43081,US
8,4524,Reba Morris,755 Hanover Street,High Point,NC,27265,US
9,9886,Nomusa Knight,8787 River Street,Palm City,FL,34990,US
10,9815,Romaine Dunlap,72 1st Street,Boston,MA,2127,US
11,7571,Regan Wilcox,55 Brewery Drive,North Ridgeville,OH,44039,US
12,1980,Forest Grimes,306 South Peninsula Road,Dayton,OH,45420,US
13,335,Feliciana Gillespie,62 Old Carriage Drive,Mount Vernon,NY,10550,US
14,4687,Ella Logan,8758 Chapel Street,Sandusky,OH,44870,US
15,3821,Abel Black,88 Beacon Lane,Bonita Springs,FL,34135,US
16,9607,Josceline Mills,784 Bridge Street,Harrisonburg,VA,22801,US
17,6323,Kit Dixon,115 Proctor Street,Margantown,WV,26508,US
18,6355,Annice Ruiz,8352 Hartford Street,Chevy Chase,MD,20815,USA
19,4374,Alesia Rubio,726 Charles Drive,Douglasville,GA,30134,US
20,9080,Magnolia Craig,247 Paris Hill Avenue,Solon,OH,44139,US
21,9080,Magnolia Craig,247 Paris Hill Avenue,Solon,OH,44139,US
22,9080,Magnolia Craig,247 Paris Hill Avenue,Solon,OH,44139,USA
23,5306,Elouan Blanchard,8328 North Cobblestone Avenue,Pueblo,CO,81001,US
24,2816,McKinley Cummings,7302 Surrey Court,Ronkonkoma,NY,11779,US
25,1268,Trecia Costa,32 Circle Drive,Paterson,NJ,7501,US
26,4297,Placide Chambers,9212 Birchpond Street,Winston Salem,NC,27103,US
27,4957,Korey Savage,9258 Woodland Street,Glen Ellyn,IL,60137,US
28,4957,Korey Savage,9258 Woodland Street,Glen Ellyn,IL,60137,US

In [19]:
w1.head()

,customer_id,name,address,city,state,zipcode,country
0,1980,Leocadia Andersen,7015 Fairground Street,Dearborn,MI,48124,US
1,2463,Chad Lucero,142 Wakehurst Drive,Santa Clara,CA,95050,US
2,1978,Stone Randall,898 Peninsula Circle,Oakland Gardens,NY,11364,US
3,9383,Emelia Braun,101 Military Street,Blacksburg,VA,24060,US
4,8940,Ridley Velez,280 Pennington Drive,Clemmens,NC,27012,US

In [20]:
w1.tail()

,customer_id,name,address,city,state,zipcode,country
24,2816,McKinley Cummings,7302 Surrey Court,Ronkonkoma,NY,11779,US
25,1268,Trecia Costa,32 Circle Drive,Paterson,NJ,7501,US
26,4297,Placide Chambers,9212 Birchpond Street,Winston Salem,NC,27103,US
27,4957,Korey Savage,9258 Woodland Street,Glen Ellyn,IL,60137,US
28,4957,Korey Savage,9258 Woodland Street,Glen Ellyn,IL,60137,US

In [21]:
w1.shape

(29, 7)

In [22]:
w1.sort_values

<bound method DataFrame.sort_values of     customer_id                 name                        address  \
0          1980    Leocadia Andersen         7015 Fairground Street
1          2463          Chad Lucero            142 Wakehurst Drive
2          1978        Stone Randall           898 Peninsula Circle
3          9383         Emelia Braun            101 Military Street
4          8940         Ridley Velez           280 Pennington Drive
5          8940         Ridley Velez           280 Pennington Drive
6          2512        Devadas Sloan          8906 East John Street
7          1928       Jamaal Proctor                   374 New Lane
8          4524          Reba Morris             755 Hanover Street
9          9886        Nomusa Knight              8787 River Street
10         9815       Romaine Dunlap                  72 1st Street
11         7571         Regan Wilcox               55 Brewery Drive
12         1980        Forest Grimes       306 South Peninsula Road
13          335  Feliciana Gillespie          62 Old Carriage Drive
14         4687           Ella Logan             8758 Chapel Street
15         3821           Abel Black                 88 Beacon Lane
16         9607      Josceline Mills              784 Bridge Street
17         6323            Kit Dixon             115 Proctor Street
18         6355          Annice Ruiz           8352 Hartford Street
19         4374         Alesia Rubio              726 Charles Drive
20         9080       Magnolia Craig          247 Paris Hill Avenue
21         9080       Magnolia Craig          247 Paris Hill Avenue
22         9080       Magnolia Craig          247 Paris Hill Avenue
23         5306     Elouan Blanchard  8328 North Cobblestone Avenue
24         2816    McKinley Cummings              7302 Surrey Court
25         1268         Trecia Costa                32 Circle Drive
26         4297     Placide Chambers          9212 Birchpond Street
27         4957         Korey Savage           9258 Woodland Street
28         4957         Korey Savage           9258 Woodland Street

                city state  zipcode country
0           Dearborn    MI    48124      US
1        Santa Clara    CA    95050      US
2    Oakland Gardens    NY    11364      US
3         Blacksburg    VA    24060      US
4           Clemmens    NC    27012      US
5           Clemmens    NC    27012      US
6       Carol Stream    IL    60188      US
7        Westerville    OH    43081      US
8         High Point    NC    27265      US
9          Palm City    FL    34990      US
10            Boston    MA     2127      US
11  North Ridgeville    OH    44039      US
12            Dayton    OH    45420      US
13      Mount Vernon    NY    10550      US
14          Sandusky    OH    44870      US
15    Bonita Springs    FL    34135      US
16      Harrisonburg    VA    22801      US
17        Margantown    WV    26508      US
18       Chevy Chase    MD    20815     USA
19      Douglasville    GA    30134      US
20             Solon    OH    44139      US
21             Solon   OH     44139      US
22             Solon    OH    44139     USA
23            Pueblo    CO    81001      US
24        Ronkonkoma    NY    11779      US
25          Paterson    NJ     7501      US
26     Winston Salem    NC    27103      US
27        Glen Ellyn    IL    60137      US
28        Glen Ellyn    IL    60137      US  >

In [23]:
w1.columns

Index(['customer_id', 'name', 'address', 'city', 'state', 'zipcode',
       'country'],
      dtype='object')

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [24]:
'''
series - immutable
Dataframe - mutable
Panel - mutable

'''

'\nseries - immutable\nDataframe - mutable\nPanel - mutable\n\n'

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [25]:
s1 = pd.Series(['customer_id'])

In [26]:
s1

0    customer_id
dtype: object

In [27]:
s2 = pd.Series(['name'])

In [28]:
s2

0    name
dtype: object

In [29]:
s3 = pd.DataFrame([['customer_id','name']])

In [30]:
s3

             0     1
0  customer_id  name